/*7.1. 학습내용
2중 for문
7.2. 문제
2중 for문을 이용하여 “실행결과”와 같이 구구단을 출력한다.
7.3. 실행결과
1*1=1
1*2=2
1*3=3
1*4=4
1*5=5
1*6=6
1*7=7
1*8=8
1*9=9
2*1=2
2*2=4
생략
8*7=56
8*8=64
8*9=72
9*1=9
9*2=18
9*3=27
9*4=36
9*5=45
9*6=54
9*7=63
9*8=72
9*9=81*/
public class Q7 {
    public static void main(String[] args){
        int a,b,c;
        c=0;
        for(a=1; a<=9; a++){
            for(b=1; b<=9; b++){
                c=a*b;
                System.out.println(a+"*"+b+"="+c);
            }
        }
    }
}
